# 1 Қолданушыдан алған екі санның көбейтіндісінен x,y,z айнымалыларының қосындысын азайтыңыз,
# мәнін экранға шығарыңыз

# a = int(input('1 wi san = '))
# b = int(input('2 wi san = '))
# result = (a*b) - (x+y+z)

# 2 у ті х ке бөлгендегі бүтін бөлігін экранға жаздырыңыз
#
# result = y // x

# 3 (х,у,z) қосындысын 3 ке бөлгендегі қалдықты экранға жаздырыңыз 
#
# result = (x+y+z) % 3

# 4 у тің х ші дәрежесін есептеп экранға шығарыңыз
#
# result = y ** x

# 5 х,*у,z = numbers  атаған кездегі z тің кубын есептеңіз және экранға шығарыңыз
# x,y,z = 2, 5, 10
# numbers = 1, 5, 7, 10, 6

# х,*у,z = numbers
# result = z ** 3

# 6 х,*у,z = numbers  атаған кезде у тің мүшелерінің қосындысын экранға шығарыңыз
# x, *y, z = numbers

# print(y[0] + y[1]+ y[2])

x,y,z = 5,10,15

x += 5    # x = x + 5
x -= 5    # x = x - 5
x *= 5    # x = x * 5
x /= 5    # x = x / 5
x //= 5    # x = x // 5
x **= 5    # x = x ** 5
x %= 5    # x = x % 5
print(x)
